Revit 2027 API
ParameterTypeId.ViewAnchor Property
 "View Anchor"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewAnchor { get; }
Public Shared ReadOnly Property ViewAnchor As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewAnchor {
	ForgeTypeId^ get ();
}
static member ViewAnchor : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace